## Importing Pandas

In [2]:
import pandas as pd

In [3]:
pd.__version__

'3.0.0'

In [4]:
df = pd.read_csv('Amazon Sale Report.csv')

/var/folders/c7/zbnjz_xj23g1ffksftq8lmv40000gn/T/ipykernel_23482/2474663059.py:1: DtypeWarning: Columns (0: Unnamed: 22) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('Amazon Sale Report.csv')

In [5]:
df.head(3)

,index,Order ID,Date,Status,Fulfilment,Sales Channel,ship-service-level,Style,SKU,Category,...,currency,Amount,ship-city,ship-state,ship-postal-code,ship-country,promotion-ids,B2B,fulfilled-by,Unnamed: 22
0,0,405-8078784-5731545,04-30-22,Cancelled,Merchant,Amazon.in,Standard,SET389,SET389-KR-NP-S,Set,...,INR,647.62,MUMBAI,MAHARASHTRA,400081.0,IN,NaN,False,Easy Ship,NaN
1,1,171-9198151-1101146,04-30-22,Shipped - Delivered to Buyer,Merchant,Amazon.in,Standard,JNE3781,JNE3781-KR-XXXL,kurta,...,INR,406.00,BENGALURU,KARNATAKA,560085.0,IN,Amazon PLCC Free-Financing Universal Merchant ...,False,Easy Ship,NaN
2,2,404-0687676-7273146,04-30-22,Shipped,Amazon,Amazon.in,Expedited,JNE3371,JNE3371-KR-XL,kurta,...,INR,329.00,NAVI MUMBAI,MAHARASHTRA,410210.0,IN,IN Core Free Shipping 2015/04/08 23-48-5-108,True,NaN,NaN

In [6]:
df.set_index('index', inplace=True)

In [7]:
df.head(3)

,Order ID,Date,Status,Fulfilment,Sales Channel,ship-service-level,Style,SKU,Category,Size,...,currency,Amount,ship-city,ship-state,ship-postal-code,ship-country,promotion-ids,B2B,fulfilled-by,Unnamed: 22
index,,,,,,,,,,,,,,,,,,,,,
0,405-8078784-5731545,04-30-22,Cancelled,Merchant,Amazon.in,Standard,SET389,SET389-KR-NP-S,Set,S,...,INR,647.62,MUMBAI,MAHARASHTRA,400081.0,IN,NaN,False,Easy Ship,NaN
1,171-9198151-1101146,04-30-22,Shipped - Delivered to Buyer,Merchant,Amazon.in,Standard,JNE3781,JNE3781-KR-XXXL,kurta,3XL,...,INR,406.00,BENGALURU,KARNATAKA,560085.0,IN,Amazon PLCC Free-Financing Universal Merchant ...,False,Easy Ship,NaN
2,404-0687676-7273146,04-30-22,Shipped,Amazon,Amazon.in,Expedited,JNE3371,JNE3371-KR-XL,kurta,XL,...,INR,329.00,NAVI MUMBAI,MAHARASHTRA,410210.0,IN,IN Core Free Shipping 2015/04/08 23-48-5-108,True,NaN,NaN

In [8]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 128975 entries, 0 to 128974
Data columns (total 23 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   Order ID            128975 non-null  str
 1   Date                128975 non-null  str
 2   Status              128975 non-null  str
 3   Fulfilment          128975 non-null  str
 4   Sales Channel       128975 non-null  str
 5   ship-service-level  128975 non-null  str
 6   Style               128975 non-null  str
 7   SKU                 128975 non-null  str
 8   Category            128975 non-null  str
 9   Size                128975 non-null  str
 10  ASIN                128975 non-null  str
 11  Courier Status      122103 non-null  str
 12  Qty                 128975 non-null  int64
 13  currency            121180 non-null  str
 14  Amount              121180 non-null  float64
 15  ship-city           128942 non-null  str
 16  ship-state          128942 non-null  str
 17  ship-postal-code    128942 non-null  float64
 18  ship-country        128942 non-null  str
 19  promotion-ids       79822 non-null   str
 20  B2B                 128975 non-null  bool
 21  fulfilled-by        39277 non-null   str
 22  Unnamed: 22         79925 non-null   object
dtypes: bool(1), float64(2), int64(1), object(1), str(18)
memory usage: 21.8+ MB

In [9]:
df.describe()

                 Qty         Amount  ship-postal-code
count  128975.000000  121180.000000     128942.000000
mean        0.904431     648.561465     463966.236509
std         0.313354     281.211687     191476.764941
min         0.000000       0.000000     110001.000000
25%         1.000000     449.000000     382421.000000
50%         1.000000     605.000000     500033.000000
75%         1.000000     788.000000     600024.000000
max        15.000000    5584.000000     989898.000000

In [10]:
df.shape

(128975, 23)

In [11]:
df.size

2966425

In [12]:
df.tail()

,Order ID,Date,Status,Fulfilment,Sales Channel,ship-service-level,Style,SKU,Category,Size,...,currency,Amount,ship-city,ship-state,ship-postal-code,ship-country,promotion-ids,B2B,fulfilled-by,Unnamed: 22
index,,,,,,,,,,,,,,,,,,,,,
128970,406-6001380-7673107,05-31-22,Shipped,Amazon,Amazon.in,Expedited,JNE3697,JNE3697-KR-XL,kurta,XL,...,INR,517.0,HYDERABAD,TELANGANA,500013.0,IN,NaN,False,NaN,False
128971,402-9551604-7544318,05-31-22,Shipped,Amazon,Amazon.in,Expedited,SET401,SET401-KR-NP-M,Set,M,...,INR,999.0,GURUGRAM,HARYANA,122004.0,IN,IN Core Free Shipping 2015/04/08 23-48-5-108,False,NaN,False
128972,407-9547469-3152358,05-31-22,Shipped,Amazon,Amazon.in,Expedited,J0157,J0157-DR-XXL,Western Dress,XXL,...,INR,690.0,HYDERABAD,TELANGANA,500049.0,IN,NaN,False,NaN,False
128973,402-6184140-0545956,05-31-22,Shipped,Amazon,Amazon.in,Expedited,J0012,J0012-SKD-XS,Set,XS,...,INR,1199.0,Halol,Gujarat,389350.0,IN,IN Core Free Shipping 2015/04/08 23-48-5-108,False,NaN,False
128974,408-7436540-8728312,05-31-22,Shipped,Amazon,Amazon.in,Expedited,J0003,J0003-SET-S,Set,S,...,INR,696.0,Raipur,CHHATTISGARH,492014.0,IN,IN Core Free Shipping 2015/04/08 23-48-5-108,False,NaN,False

## Data Cleaning

In [13]:
df.isnull().sum().sort_values(ascending=False)

fulfilled-by          89698
promotion-ids         49153
Unnamed: 22           49050
currency               7795
Amount                 7795
Courier Status         6872
ship-city                33
ship-country             33
ship-postal-code         33
ship-state               33
Style                     0
Status                    0
B2B                       0
Fulfilment                0
Sales Channel             0
SKU                       0
ship-service-level        0
Qty                       0
Date                      0
ASIN                      0
Size                      0
Category                  0
Order ID                  0
dtype: int64

### Drop useless columns and Fill null values

In [14]:
df.drop(columns=['Unnamed: 22'], inplace=True)

In [15]:
df['Amount'] = df['Amount'].fillna(0)

In [16]:
df.dropna(subset=['ship-city', 'ship-state'], inplace=True)

In [17]:
df['Courier Status'] = df['Courier Status'].fillna('Unshipped')

In [18]:
df.isnull().sum()

Order ID                  0
Date                      0
Status                    0
Fulfilment                0
Sales Channel             0
ship-service-level        0
Style                     0
SKU                       0
Category                  0
Size                      0
ASIN                      0
Courier Status            0
Qty                       0
currency               7793
Amount                    0
ship-city                 0
ship-state                0
ship-postal-code          0
ship-country              0
promotion-ids         49145
B2B                       0
fulfilled-by          89678
dtype: int64

# Overall Stats

In [19]:
total_revenue = df['Amount'].sum()
total_orders = df['Order ID'].nunique()
avg_order_val = total_revenue/total_orders

print(f"Total Revenue: {total_revenue}")
print(f"No. of Orders: {total_orders}")
print(f"Average order value: {avg_order_val}")

Total Revenue: 78574007.30000001
No. of Orders: 120350
Average order value: 652.8791632737849

## Fulfilment

In [20]:
df['Fulfilment'].value_counts().reset_index()

  Fulfilment  count
0     Amazon  89678
1   Merchant  39264

In [21]:
df.groupby('Fulfilment')['Amount'].sum().sort_values(ascending=False).reset_index()

  Fulfilment      Amount
0     Amazon  54311285.0
1   Merchant  24262722.3

In [22]:
df.groupby('Fulfilment').agg(Mean = ('Amount', 'mean')).reset_index()

  Fulfilment        Mean
0     Amazon  605.625516
1   Merchant  617.938119

## Status

In [23]:
df['Status'].value_counts().reset_index()

                           Status  count
0                         Shipped  77788
1    Shipped - Delivered to Buyer  28762
2                       Cancelled  18325
3    Shipped - Returned to Seller   1950
4             Shipped - Picked Up    973
5                         Pending    658
6   Pending - Waiting for Pick Up    281
7   Shipped - Returning to Seller    145
8      Shipped - Out for Delivery     35
9     Shipped - Rejected by Buyer     11
10                       Shipping      8
11      Shipped - Lost in Transit      5
12              Shipped - Damaged      1

In [24]:
df.groupby('Status')['Amount'].sum().sort_values(ascending=False).reset_index()

                           Status      Amount
0                         Shipped  50314279.0
1    Shipped - Delivered to Buyer  18645779.0
2                       Cancelled   6917254.3
3    Shipped - Returned to Seller   1268015.0
4             Shipped - Picked Up    661252.0
5                         Pending    430271.0
6   Pending - Waiting for Pick Up    192138.0
7   Shipped - Returning to Seller    107620.0
8      Shipped - Out for Delivery     26971.0
9     Shipped - Rejected by Buyer      7295.0
10      Shipped - Lost in Transit      1997.0
11              Shipped - Damaged      1136.0
12                       Shipping         0.0

In [25]:
df.groupby('Status').agg(Mean = ('Amount', 'mean')).reset_index()

                           Status         Mean
0                       Cancelled   377.476360
1                         Pending   653.907295
2   Pending - Waiting for Pick Up   683.765125
3                         Shipped   646.812863
4               Shipped - Damaged  1136.000000
5    Shipped - Delivered to Buyer   648.278249
6       Shipped - Lost in Transit   399.400000
7      Shipped - Out for Delivery   770.600000
8             Shipped - Picked Up   679.601233
9     Shipped - Rejected by Buyer   663.181818
10   Shipped - Returned to Seller   650.264103
11  Shipped - Returning to Seller   742.206897
12                       Shipping     0.000000

## Ship Service Level

In [26]:
df['ship-service-level'].value_counts().reset_index()

  ship-service-level  count
0          Expedited  88595
1           Standard  40347

In [27]:
df.groupby('ship-service-level')[['Amount']].sum().sort_index(ascending=False).reset_index()

  ship-service-level      Amount
0           Standard  24299690.3
1          Expedited  54274317.0

In [28]:
df.groupby('ship-service-level').agg(Mean = ('Amount', 'mean')).reset_index()

  ship-service-level        Mean
0          Expedited  612.611513
1           Standard  602.267586

## Category

In [29]:
df['Category'].value_counts().reset_index()

        Category  count
0            Set  50272
1          kurta  49859
2  Western Dress  15499
3            Top  10620
4   Ethnic Dress   1159
5         Blouse    926
6         Bottom    440
7          Saree    164
8        Dupatta      3

In [30]:
df.groupby('Category', as_index=False).agg(Total_Amt = ('Amount', 'sum')
                                       ).sort_values(by='Total_Amt', ascending=False).reset_index(drop= True)

        Category    Total_Amt
0            Set  39195176.03
1          kurta  21291538.70
2  Western Dress  11215337.69
3            Top   5346812.30
4   Ethnic Dress    791217.66
5         Blouse    458408.18
6         Bottom    150667.98
7          Saree    123933.76
8        Dupatta       915.00

In [31]:
df.groupby('Category').agg(Mean = ('Amount', 'mean')).reset_index()

        Category        Mean
0         Blouse  495.041231
1         Bottom  342.427227
2        Dupatta  305.000000
3   Ethnic Dress  682.672701
4          Saree  755.693659
5            Set  779.662158
6            Top  503.466318
7  Western Dress  723.616859
8          kurta  427.035013

## Size

In [32]:
df['Size'].value_counts().reset_index()

    Size  count
0      M  22704
1      L  22123
2     XL  20872
3    XXL  18093
4      S  17084
5    3XL  14815
6     XS  11160
7    6XL    738
8    5XL    550
9    4XL    425
10  Free    378

In [33]:
df.groupby('Size')['Amount'].sum().sort_values(ascending=False).reset_index()

    Size       Amount
0      M  13903340.37
1      L  13229201.19
2     XL  12463172.86
3    XXL  10635062.45
4      S  10625883.18
5    3XL   9156771.68
6     XS   7021263.20
7    6XL    576249.33
8    5XL    425156.63
9    4XL    332713.64
10  Free    205192.77

In [34]:
df.groupby('Size').agg(Mean = ('Amount', 'mean')).reset_index()

    Size        Mean
0    3XL  618.074362
1    4XL  782.855624
2    5XL  773.012055
3    6XL  780.825650
4   Free  542.838016
5      L  597.984052
6      M  612.374047
7      S  621.978646
8     XL  597.124035
9     XS  629.145448
10   XXL  587.799837

## Ship State

In [35]:
df['ship-state'].value_counts().reset_index()

       ship-state  count
0     MAHARASHTRA  22260
1       KARNATAKA  17326
2      TAMIL NADU  11483
3       TELANGANA  11330
4   UTTAR PRADESH  10638
..            ...    ...
64       Nagaland      1
65          bihar      1
66        Mizoram      1
67       rajsthan      1
68       Rajsthan      1

[69 rows x 2 columns]

In [36]:
df.groupby('ship-state')['Amount'].sum().sort_values(ascending=False).reset_index()

       ship-state       Amount
0     MAHARASHTRA  13335534.14
1       KARNATAKA  10481114.37
2       TELANGANA   6916615.65
3   UTTAR PRADESH   6816642.08
4      TAMIL NADU   6515650.11
..            ...          ...
64       rajsthan       521.00
65             AR       493.00
66       Rajsthan       443.00
67             PB       399.00
68            APO         0.00

[69 rows x 2 columns]

In [37]:
df.groupby('ship-state').agg(Mean = ('Amount', 'mean')).reset_index()

            ship-state        Mean
0   ANDAMAN & NICOBAR   617.601634
1       ANDHRA PRADESH  592.970851
2                  APO    0.000000
3                   AR  493.000000
4    ARUNACHAL PRADESH  675.425532
..                 ...         ...
64                 goa  493.400000
65              orissa  597.000000
66              punjab  615.857143
67           rajasthan  657.666667
68            rajsthan  521.000000

[69 rows x 2 columns]

## Ship City

In [38]:
df['ship-city'].value_counts().reset_index()

                      ship-city  count
0                     BENGALURU  11217
1                     HYDERABAD   8074
2                        MUMBAI   6126
3                     NEW DELHI   5795
4                       CHENNAI   5421
...                         ...    ...
8950           VARANASIVaranasi      1
8951           Cherukunnu (p.o)      1
8952  GULABPURA, Distt BHILWARA      1
8953      Prayagraj (ALLAHABAD)      1
8954                      Halol      1

[8955 rows x 2 columns]

In [39]:
df.groupby('ship-city')['Amount'].sum().sort_values(ascending=False).reset_index()

             ship-city      Amount
0            BENGALURU  6849664.99
1            HYDERABAD  4946032.82
2               MUMBAI  3704461.80
3            NEW DELHI  3613874.78
4              CHENNAI  3098745.74
...                ...         ...
8950         MIRA ROAD        0.00
8951        MERTA ROAD        0.00
8952         SHIKRAPUR        0.00
8953           katpadi        0.00
8954  Cherukunnu (p.o)        0.00

[8955 rows x 2 columns]

In [40]:
df.groupby('ship-city').agg(Mean = ('Amount', 'mean')).reset_index()

                                           ship-city    Mean
0     (Chikmagalur disterict).     (N.R pur thaluku)   389.0
1                     (Via Cuncolim)Quepem,South Goa  1163.0
2                                         ,HYDERABAD   563.0
3                 ,raibarely road faizabad (Ayodhya)  1122.0
4                                            ..katra   641.0
...                                              ...     ...
8950                                        yavatmal   735.0
8951                                          yazali   487.0
8952                                        yellapur   824.0
8953                                        zirakpur   852.0
8954                                            लखनऊ  1001.5

[8955 rows x 2 columns]

In [41]:
df['promotion-ids'].value_counts().reset_index()

                                          promotion-ids  count
0          IN Core Free Shipping 2015/04/08 23-48-5-108  46085
1               Duplicated A12RHGVGRWOT3S 1560498941486    489
2     Amazon PLCC Free-Financing Universal Merchant ...    458
3                Duplicated AYTJSBA8ZOP16 1567159860988    433
4     Amazon PLCC Free-Financing Universal Merchant ...    316
...                                                 ...    ...
5782  Amazon PLCC Free-Financing Universal Merchant ...      1
5783  Amazon PLCC Free-Financing Universal Merchant ...      1
5784  Amazon PLCC Free-Financing Universal Merchant ...      1
5785  Amazon PLCC Free-Financing Universal Merchant ...      1
5786  Amazon PLCC Free-Financing Universal Merchant ...      1

[5787 rows x 2 columns]

In [42]:
df['B2B'].value_counts().reset_index()

     B2B   count
0  False  128071
1   True     871

# Month Wise Report

In [43]:
df['month'] = pd.to_datetime(df['Date']).dt.month_name()

/var/folders/c7/zbnjz_xj23g1ffksftq8lmv40000gn/T/ipykernel_23482/3696600459.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['month'] = pd.to_datetime(df['Date']).dt.month_name()

In [44]:
df.head(3)

,Order ID,Date,Status,Fulfilment,Sales Channel,ship-service-level,Style,SKU,Category,Size,...,currency,Amount,ship-city,ship-state,ship-postal-code,ship-country,promotion-ids,B2B,fulfilled-by,month
index,,,,,,,,,,,,,,,,,,,,,
0,405-8078784-5731545,04-30-22,Cancelled,Merchant,Amazon.in,Standard,SET389,SET389-KR-NP-S,Set,S,...,INR,647.62,MUMBAI,MAHARASHTRA,400081.0,IN,NaN,False,Easy Ship,April
1,171-9198151-1101146,04-30-22,Shipped - Delivered to Buyer,Merchant,Amazon.in,Standard,JNE3781,JNE3781-KR-XXXL,kurta,3XL,...,INR,406.00,BENGALURU,KARNATAKA,560085.0,IN,Amazon PLCC Free-Financing Universal Merchant ...,False,Easy Ship,April
2,404-0687676-7273146,04-30-22,Shipped,Amazon,Amazon.in,Expedited,JNE3371,JNE3371-KR-XL,kurta,XL,...,INR,329.00,NAVI MUMBAI,MAHARASHTRA,410210.0,IN,IN Core Free Shipping 2015/04/08 23-48-5-108,True,NaN,April

In [45]:
df['month'].value_counts().reset_index()

   month  count
0  April  49054
1    May  42028
2   June  37689
3  March    171

In [46]:
df.groupby('month')['Amount'].sum().reset_index()

   month       Amount
0  April  28831249.32
1   June  23421223.38
2  March    101683.85
3    May  26219850.75

In [47]:
df.groupby('month')['Amount'].mean()

month
April    587.745124
June     621.433930
March    594.642398
May      623.866250
Name: Amount, dtype: float64

## March

### Total Revenue, Order, AOV

In [48]:
march_totalAmt = df.loc[df['month'] == 'March', 'Amount'].sum()
march_totalOdr = df.loc[df['month'] == 'March', 'Order ID'].nunique()
march_AOV = march_totalAmt/march_totalOdr

print(f"Total Order Amount in March: {march_totalAmt}")
print(f"Total Orders in March: {march_totalOdr}")
print(f"Average Order Value in March: {march_AOV}")

Total Order Amount in March: 101683.85
Total Orders in March: 158
Average Order Value in March: 643.568670886076

### Ship State

In [49]:
df[df['month'] == 'March']['ship-state'].value_counts()

ship-state
KARNATAKA          24
MAHARASHTRA        24
UTTAR PRADESH      19
WEST BENGAL        16
TAMIL NADU         14
DELHI              10
Gujarat             9
KERALA              9
HARYANA             8
TELANGANA           8
BIHAR               6
ODISHA              6
ANDHRA PRADESH      5
RAJASTHAN           3
MADHYA PRADESH      2
JHARKHAND           2
CHHATTISGARH        1
GOA                 1
TRIPURA             1
CHANDIGARH          1
JAMMU & KASHMIR     1
UTTARAKHAND         1
Name: count, dtype: int64

In [50]:
df[df['month'] == 'March'].groupby('ship-state')['Amount'].sum().sort_values(ascending=False)

ship-state
MAHARASHTRA        16367.00
KARNATAKA          13544.43
UTTAR PRADESH      10979.00
WEST BENGAL         8973.00
TAMIL NADU          8565.95
DELHI               7424.00
KERALA              4977.52
BIHAR               4637.00
Gujarat             4591.00
TELANGANA           4080.00
ANDHRA PRADESH      3621.00
HARYANA             3397.19
ODISHA              3073.00
RAJASTHAN           1512.00
UTTARAKHAND         1138.00
JHARKHAND           1098.00
CHHATTISGARH         899.00
JAMMU & KASHMIR      724.76
TRIPURA              688.00
GOA                  542.00
MADHYA PRADESH       499.00
CHANDIGARH           353.00
Name: Amount, dtype: float64

In [51]:
df[df['month'] == 'March'].groupby('ship-state')['Amount'].mean().sort_values(ascending=False)

ship-state
UTTARAKHAND        1138.000000
CHHATTISGARH        899.000000
BIHAR               772.833333
DELHI               742.400000
JAMMU & KASHMIR     724.760000
ANDHRA PRADESH      724.200000
TRIPURA             688.000000
MAHARASHTRA         681.958333
TAMIL NADU          611.853571
UTTAR PRADESH       577.842105
KARNATAKA           564.351250
WEST BENGAL         560.812500
KERALA              553.057778
JHARKHAND           549.000000
GOA                 542.000000
ODISHA              512.166667
Gujarat             510.111111
TELANGANA           510.000000
RAJASTHAN           504.000000
HARYANA             424.648750
CHANDIGARH          353.000000
MADHYA PRADESH      249.500000
Name: Amount, dtype: float64

### Ship City

In [52]:
df[df['month'] == 'March']['ship-city'].value_counts()

ship-city
BENGALURU    16
NEW DELHI     9
CHENNAI       8
KOLKATA       8
HYDERABAD     8
             ..
DEHRADUN      1
RANCHI        1
UDAIPUR       1
REWA          1
Gaya          1
Name: count, Length: 84, dtype: int64

In [53]:
df[df['month'] == 'March'].groupby('ship-city')['Amount'].sum().sort_values(ascending=False)

ship-city
BENGALURU       7565.43
NEW DELHI       7070.00
PUNE            5189.00
CHENNAI         5030.00
HYDERABAD       4080.00
                 ...
VARANASI         313.00
NADUVANNUR       248.00
REWA               0.00
Chandauli UP       0.00
Mumbra             0.00
Name: Amount, Length: 84, dtype: float64

In [54]:
df[df['month'] == 'March'].groupby('ship-city')['Amount'].mean().sort_values(ascending=False)

ship-city
JAGALUR         1496.0
MADURAI         1271.0
Bhiwandi        1165.0
DEHRADUN        1138.0
NAVI MUMBAI     1099.0
                 ...
KARNAL           272.5
NADUVANNUR       248.0
Chandauli UP       0.0
REWA               0.0
Mumbra             0.0
Name: Amount, Length: 84, dtype: float64

### Fulfilment

In [55]:
df[df['month'] == 'March']['Fulfilment'].value_counts()

Fulfilment
Amazon      148
Merchant     23
Name: count, dtype: int64

In [56]:
df[df['month'] == 'March'].groupby('Fulfilment')['Amount'].sum()

Fulfilment
Amazon      87464.00
Merchant    14219.85
Name: Amount, dtype: float64

In [57]:
df[df['month'] == 'March'].groupby('Fulfilment')['Amount'].mean()

Fulfilment
Amazon      590.972973
Merchant    618.254348
Name: Amount, dtype: float64

### Size

In [58]:
df[df['month'] == 'March']['Size'].value_counts()

Size
L      37
M      30
XXL    27
XL     26
S      20
3XL    16
XS     11
6XL     2
5XL     2
Name: count, dtype: int64

In [59]:
df[df['month'] == 'March'].groupby('Size')['Amount'].sum().sort_values(ascending=False)

Size
L      21083.90
M      19941.95
XL     17121.00
XXL    13266.00
S      13117.00
XS      7655.00
3XL     7422.00
6XL     1122.00
5XL      955.00
Name: Amount, dtype: float64

In [60]:
df[df['month'] == 'March'].groupby('Size')['Amount'].mean()

Size
3XL    463.875000
5XL    477.500000
6XL    561.000000
L      569.835135
M      664.731667
S      655.850000
XL     658.500000
XS     695.909091
XXL    491.333333
Name: Amount, dtype: float64

### Ship Service Level

In [61]:
df[df['month'] == 'March']['ship-service-level'].value_counts()

ship-service-level
Expedited    148
Standard      23
Name: count, dtype: int64

In [62]:
df[df['month'] == 'March'].groupby('ship-service-level')['Amount'].sum()

ship-service-level
Expedited    87464.00
Standard     14219.85
Name: Amount, dtype: float64

### Category

In [63]:
df[df['month'] == 'March']['Category'].value_counts()

Category
kurta            76
Set              75
Western Dress     9
Top               9
Ethnic Dress      1
Blouse            1
Name: count, dtype: int64

In [64]:
df[df['month'] == 'March'].groupby('Category')['Amount'].sum().sort_values(ascending=False)

Category
Set              53884.00
kurta            34256.57
Western Dress     7653.28
Top               4511.00
Ethnic Dress      1099.00
Blouse             280.00
Name: Amount, dtype: float64

In [65]:
df[df['month'] == 'March'].groupby('Category')['Amount'].mean().sort_values(ascending=False)

Category
Ethnic Dress     1099.000000
Western Dress     850.364444
Set               718.453333
Top               501.222222
kurta             450.744342
Blouse            280.000000
Name: Amount, dtype: float64

### B2B

In [66]:
df[df['month'] == 'March']['B2B'].value_counts()

B2B
False    171
Name: count, dtype: int64

In [67]:
df[df['month'] == 'March'].groupby('B2B')['Amount'].sum()

B2B
False    101683.85
Name: Amount, dtype: float64

### Courier Status

In [68]:
df[df['month'] == 'March']['Courier Status'].value_counts()

Courier Status
Shipped      152
Unshipped     10
Cancelled      9
Name: count, dtype: int64

In [69]:
df[df['month'] == 'March'].groupby('Courier Status')['Amount'].sum()

Courier Status
Cancelled        0.00
Shipped      94810.00
Unshipped     6873.85
Name: Amount, dtype: float64

## April

### Total Revenue, Order, AOV

In [70]:
april_totalAmt = df.loc[df['month'] == 'April', 'Amount'].sum()
april_totalOdr = df.loc[df['month'] == 'April', 'Order ID'].nunique()
april_AOV = april_totalAmt/april_totalOdr

print(f"Total Order Amount in April: {april_totalAmt}")
print(f"Total Orders in April: {april_totalOdr}")
print(f"Average Order Value in April: {april_AOV}")

Total Order Amount in April: 28831249.32
Total Orders in April: 45847
Average Order Value in April: 628.8579257094249

### Ship State

In [71]:
df[df['month'] == 'April']['ship-state'].value_counts()

ship-state
MAHARASHTRA               8474
KARNATAKA                 6486
UTTAR PRADESH             4154
TAMIL NADU                4024
TELANGANA                 3964
DELHI                     2658
WEST BENGAL               2583
KERALA                    2476
ANDHRA PRADESH            1929
Gujarat                   1732
HARYANA                   1663
RAJASTHAN                 1041
MADHYA PRADESH             947
BIHAR                      862
ODISHA                     835
ASSAM                      745
PUNJAB                     721
UTTARAKHAND                638
JHARKHAND                  635
GOA                        454
CHHATTISGARH               369
HIMACHAL PRADESH           321
JAMMU & KASHMIR            274
MANIPUR                    130
PUDUCHERRY                 125
CHANDIGARH                 115
ANDAMAN & NICOBAR           91
MEGHALAYA                   85
SIKKIM                      74
TRIPURA                     69
Delhi                       56
ARUNACHAL PRADESH           52
NAGALAND                    48
New Delhi                   34
DADRA AND NAGAR             28
MIZORAM                     26
Rajasthan                   20
Goa                         16
LADAKH                      16
Bihar                       16
Punjab                      12
delhi                       11
Odisha                       8
punjab                       8
rajasthan                    6
Manipur                      4
Chandigarh                   4
Rajshthan                    3
goa                          2
Arunachal Pradesh            2
NL                           1
Punjab/Mohali/Zirakpur       1
Puducherry                   1
RJ                           1
orissa                       1
LAKSHADWEEP                  1
PB                           1
APO                          1
Name: count, dtype: int64

In [72]:
df[df['month'] == 'April'].groupby('ship-state')['Amount'].sum().sort_values(ascending=False)

ship-state
MAHARASHTRA               4919541.85
KARNATAKA                 3763817.55
UTTAR PRADESH             2587621.11
TELANGANA                 2292896.49
TAMIL NADU                2152220.64
DELHI                     1634230.30
WEST BENGAL               1461066.89
KERALA                    1388088.74
ANDHRA PRADESH            1098614.13
HARYANA                   1038039.52
Gujarat                   1004082.48
RAJASTHAN                  640081.33
MADHYA PRADESH             578450.29
BIHAR                      560747.11
ODISHA                     519413.23
PUNJAB                     453815.15
ASSAM                      433570.88
UTTARAKHAND                404902.45
JHARKHAND                  393538.99
GOA                        258208.82
CHHATTISGARH               226979.65
HIMACHAL PRADESH           198854.54
JAMMU & KASHMIR            174184.46
MANIPUR                     88272.66
CHANDIGARH                  71655.33
PUDUCHERRY                  60354.66
ANDAMAN & NICOBAR           54295.73
SIKKIM                      49817.53
MEGHALAYA                   47337.62
TRIPURA                     39435.24
NAGALAND                    32703.15
ARUNACHAL PRADESH           32036.38
Delhi                       30038.00
New Delhi                   23398.00
DADRA AND NAGAR             16770.90
LADAKH                      13933.00
MIZORAM                     12741.00
Rajasthan                   12725.00
Bihar                       10926.00
Punjab                       8311.00
Goa                          8217.00
delhi                        6557.62
Odisha                       6077.90
punjab                       5671.00
rajasthan                    3946.00
Chandigarh                   3605.00
Manipur                      2195.00
Arunachal Pradesh            1235.00
Rajshthan                    1126.00
LAKSHADWEEP                   825.00
goa                           741.00
RJ                            685.00
orissa                        597.00
Punjab/Mohali/Zirakpur        568.00
Puducherry                    568.00
NL                            518.00
PB                            399.00
APO                             0.00
Name: Amount, dtype: float64

In [73]:
df[df['month'] == 'April'].groupby('ship-state')['Amount'].mean().sort_values(ascending=False)

ship-state
Chandigarh                901.250000
LADAKH                    870.812500
LAKSHADWEEP               825.000000
Odisha                    759.737500
punjab                    708.875000
Punjab                    692.583333
New Delhi                 688.176471
RJ                        685.000000
Bihar                     682.875000
NAGALAND                  681.315625
MANIPUR                   679.020462
SIKKIM                    673.209865
rajasthan                 657.666667
BIHAR                     650.518689
Rajasthan                 636.250000
JAMMU & KASHMIR           635.709708
UTTARAKHAND               634.643339
PUNJAB                    629.424619
HARYANA                   624.196945
CHANDIGARH                623.089826
UTTAR PRADESH             622.922752
ODISHA                    622.051772
JHARKHAND                 619.746441
HIMACHAL PRADESH          619.484548
Arunachal Pradesh         617.500000
ARUNACHAL PRADESH         616.084231
CHHATTISGARH              615.121003
RAJASTHAN                 614.871595
DELHI                     614.834575
MADHYA PRADESH            610.823960
DADRA AND NAGAR           598.960714
orissa                    597.000000
ANDAMAN & NICOBAR         596.656374
delhi                     596.147273
ASSAM                     581.974336
MAHARASHTRA               580.545415
KARNATAKA                 580.298728
Gujarat                   579.724296
TELANGANA                 578.429992
TRIPURA                   571.525217
ANDHRA PRADESH            569.525210
GOA                       568.741894
Puducherry                568.000000
Punjab/Mohali/Zirakpur    568.000000
WEST BENGAL               565.647267
KERALA                    560.617423
MEGHALAYA                 556.913176
Manipur                   548.750000
Delhi                     536.392857
TAMIL NADU                534.846083
NL                        518.000000
Goa                       513.562500
MIZORAM                   490.038462
PUDUCHERRY                482.837280
PB                        399.000000
Rajshthan                 375.333333
goa                       370.500000
APO                         0.000000
Name: Amount, dtype: float64

### Ship City

In [74]:
df[df['month'] == 'April']['ship-city'].value_counts()

ship-city
BENGALURU        4082
HYDERABAD        2762
MUMBAI           2323
NEW DELHI        2290
CHENNAI          1877
                 ...
PARASUVAIKKAL       1
nanded              1
BALIYASAN           1
VEMULAWADA          1
DERA BASSI          1
Name: count, Length: 5139, dtype: int64

In [75]:
df[df['month'] == 'April'].groupby('ship-city')['Amount'].sum().sort_values(ascending=False)

ship-city
BENGALURU                    2372849.47
HYDERABAD                    1603209.79
NEW DELHI                    1404437.04
MUMBAI                       1355120.77
CHENNAI                      1014959.44
                                ...
CHINNAMANUR                        0.00
JODA                               0.00
Amarpur                            0.00
Kakkad, Mukkam, kozhikode          0.00
URMAR TANDA                        0.00
Name: Amount, Length: 5139, dtype: float64

In [76]:
df[df['month'] == 'April'].groupby('ship-city')['Amount'].mean()

ship-city
(Chikmagalur disterict).     (N.R pur thaluku)     389.000000
,HYDERABAD                                         563.000000
53miles                                              0.000000
6th mile tadong                                    698.000000
7BARASAT                                           465.500000
                                                     ...
vikarabad                                          654.000000
virudhunagar                                       338.000000
visakhapatnam                                      432.333333
wagholi ,PUNE                                     1115.000000
yellapur                                           824.000000
Name: Amount, Length: 5139, dtype: float64

### Fulfilment

In [77]:
df[df['month'] == 'April']['Fulfilment'].value_counts()

Fulfilment
Amazon      33261
Merchant    15793
Name: count, dtype: int64

In [78]:
df[df['month'] == 'April'].groupby('Fulfilment')['Amount'].sum()

Fulfilment
Amazon      19555246.00
Merchant     9276003.32
Name: Amount, dtype: float64

In [79]:
df[df['month'] == 'April'].groupby('Fulfilment')['Amount'].mean()

Fulfilment
Amazon      587.933195
Merchant    587.349036
Name: Amount, dtype: float64

### Size

In [80]:
df[df['month'] == 'April']['Size'].value_counts()

Size
L       8631
M       8599
XL      7869
S       6702
XXL     6695
3XL     5643
XS      4405
Free     193
6XL      118
5XL      107
4XL       92
Name: count, dtype: int64

In [81]:
df[df['month'] == 'April'].groupby('Size')['Amount'].sum().sort_values(ascending=False)

Size
M       5163280.10
L       4939061.86
XL      4482010.49
S       4102608.08
XXL     3820911.00
3XL     3352834.32
XS      2692005.21
Free     100928.77
6XL       64601.96
5XL       60599.14
4XL       52408.39
Name: Amount, dtype: float64

In [82]:
df[df['month'] == 'April'].groupby('Size')['Amount'].mean()

Size
3XL     594.158129
4XL     569.656413
5XL     566.347103
6XL     547.474237
Free    522.946995
L       572.246769
M       600.451227
S       612.146834
XL      569.578154
XS      611.124906
XXL     570.711128
Name: Amount, dtype: float64

### Ship Service Level

In [83]:
df[df['month'] == 'April']['ship-service-level'].value_counts()

ship-service-level
Expedited    32846
Standard     16208
Name: count, dtype: int64

In [84]:
df[df['month'] == 'April'].groupby('ship-service-level')['Amount'].sum()

ship-service-level
Expedited    19540433.00
Standard      9290816.32
Name: Amount, dtype: float64

### Category

In [85]:
df[df['month'] == 'April']['Category'].value_counts()

Category
Set              20200
kurta            19739
Western Dress     4164
Top               3927
Blouse             418
Ethnic Dress       351
Bottom             180
Saree               75
Name: count, dtype: int64

In [86]:
df[df['month'] == 'April'].groupby('Category')['Amount'].sum().sort_values(ascending=False)

Category
Set              15502956.56
kurta             8013898.48
Western Dress     2927780.51
Top               1821400.22
Ethnic Dress       250666.65
Blouse             195583.21
Bottom              63308.45
Saree               55655.24
Name: Amount, dtype: float64

In [87]:
df[df['month'] == 'April'].groupby('Category')['Amount'].mean().sort_values(ascending=False)

Category
Set              767.473097
Saree            742.069867
Ethnic Dress     714.150000
Western Dress    703.117317
Blouse           467.902416
Top              463.814673
kurta            405.993134
Bottom           351.713611
Name: Amount, dtype: float64

### B2B

In [88]:
df[df['month'] == 'March']['B2B'].value_counts()

B2B
False    171
Name: count, dtype: int64

In [89]:
df[df['month'] == 'March'].groupby('B2B')['Amount'].sum()

B2B
False    101683.85
Name: Amount, dtype: float64

### Courier Status

In [90]:
df[df['month'] == 'March']['Courier Status'].value_counts()

Courier Status
Shipped      152
Unshipped     10
Cancelled      9
Name: count, dtype: int64

In [91]:
df[df['month'] == 'March'].groupby('Courier Status')['Amount'].sum()

Courier Status
Cancelled        0.00
Shipped      94810.00
Unshipped     6873.85
Name: Amount, dtype: float64

## May

### Total Revenue, Order, AOV

In [92]:
may_totalAmt = df.loc[df['month'] == 'May', 'Amount'].sum()
may_totalOdr = df.loc[df['month'] == 'May', 'Order ID'].nunique()
may_AOV = may_totalAmt/may_totalOdr

print(f"Total Order Amount in May: {may_totalAmt}")
print(f"Total Orders in May: {may_totalOdr}")
print(f"Average Order Value in May: {may_AOV}")

Total Order Amount in May: 26219850.75
Total Orders in May: 39210
Average Order Value in May: 668.703156082632

### Ship State

In [93]:
df[df['month'] == 'May']['ship-state'].value_counts()

ship-state
MAHARASHTRA           7322
KARNATAKA             5502
TAMIL NADU            3912
TELANGANA             3795
UTTAR PRADESH         3586
DELHI                 2208
KERALA                2096
WEST BENGAL           1822
ANDHRA PRADESH        1751
Gujarat               1524
HARYANA               1491
RAJASTHAN              869
MADHYA PRADESH         831
BIHAR                  640
PUNJAB                 637
ODISHA                 615
UTTARAKHAND            519
JHARKHAND              483
ASSAM                  451
GOA                    343
CHHATTISGARH           287
HIMACHAL PRADESH       234
JAMMU & KASHMIR        206
MANIPUR                119
CHANDIGARH             111
PUDUCHERRY             107
ANDAMAN & NICOBAR       78
NAGALAND                63
MEGHALAYA               58
SIKKIM                  57
Delhi                   56
ARUNACHAL PRADESH       51
TRIPURA                 43
New Delhi               28
DADRA AND NAGAR         23
MIZORAM                 22
Rajasthan               21
Punjab                  12
LADAKH                   9
Odisha                   8
Goa                      7
Bihar                    5
punjab                   5
Chandigarh               4
goa                      3
delhi                    3
Arunachal pradesh        2
LAKSHADWEEP              2
RJ                       1
AR                       1
Pondicherry              1
Sikkim                   1
Nagaland                 1
Arunachal Pradesh        1
bihar                    1
Name: count, dtype: int64

In [94]:
df[df['month'] == 'May'].groupby('ship-state')['Amount'].sum().sort_values(ascending=False)

ship-state
MAHARASHTRA           4514971.90
KARNATAKA             3393125.07
TELANGANA             2367669.00
UTTAR PRADESH         2351120.28
TAMIL NADU            2297397.35
DELHI                 1367346.20
KERALA                1251183.31
WEST BENGAL           1091661.45
ANDHRA PRADESH        1081460.92
HARYANA                992319.04
Gujarat                958441.50
RAJASTHAN              590043.88
MADHYA PRADESH         541768.50
BIHAR                  438144.65
ODISHA                 407757.07
PUNJAB                 404843.47
UTTARAKHAND            322713.37
JHARKHAND              310988.90
ASSAM                  290207.11
CHHATTISGARH           189647.18
GOA                    188138.33
HIMACHAL PRADESH       151399.82
JAMMU & KASHMIR        137159.71
MANIPUR                 78725.33
CHANDIGARH              73743.05
PUDUCHERRY              60369.63
NAGALAND                51747.71
ANDAMAN & NICOBAR       48499.97
SIKKIM                  42919.13
ARUNACHAL PRADESH       34811.62
MEGHALAYA               33657.13
Delhi                   32685.39
TRIPURA                 24828.09
DADRA AND NAGAR         15342.54
Rajasthan               14564.43
New Delhi               13156.95
MIZORAM                 11781.00
LADAKH                   8528.00
Punjab                   5692.00
Bihar                    4676.00
Goa                      4169.00
Odisha                   3264.86
Chandigarh               3201.62
delhi                    2794.00
punjab                   1993.00
goa                      1726.00
LAKSHADWEEP              1505.29
bihar                    1432.00
Sikkim                   1186.00
Arunachal Pradesh         700.00
Nagaland                  664.00
Arunachal pradesh         602.00
Pondicherry               529.00
AR                        493.00
RJ                        355.00
Name: Amount, dtype: float64

In [95]:
df[df['month'] == 'May'].groupby('ship-state')['Amount'].mean().sort_values(ascending=False)

ship-state
bihar                 1432.000000
Sikkim                1186.000000
LADAKH                 947.555556
Bihar                  935.200000
delhi                  931.333333
NAGALAND               821.392222
Chandigarh             800.405000
SIKKIM                 752.967193
LAKSHADWEEP            752.645000
Arunachal Pradesh      700.000000
Rajasthan              693.544286
BIHAR                  684.601016
ARUNACHAL PRADESH      682.580784
RAJASTHAN              678.991807
DADRA AND NAGAR        667.066957
JAMMU & KASHMIR        665.823835
HARYANA                665.539262
CHANDIGARH             664.351802
Nagaland               664.000000
ODISHA                 663.019626
MANIPUR                661.557395
CHHATTISGARH           660.791568
UTTAR PRADESH          655.638673
MADHYA PRADESH         651.947653
HIMACHAL PRADESH       647.007778
JHARKHAND              643.869358
ASSAM                  643.474745
PUNJAB                 635.547049
Gujarat                628.898622
TELANGANA              623.891700
UTTARAKHAND            621.798401
ANDAMAN & NICOBAR      621.794487
DELHI                  619.269112
ANDHRA PRADESH         617.624740
KARNATAKA              616.707574
MAHARASHTRA            616.630961
WEST BENGAL            599.155571
KERALA                 596.938602
Goa                    595.571429
TAMIL NADU             587.269261
Delhi                  583.667679
MEGHALAYA              580.295345
TRIPURA                577.397442
goa                    575.333333
PUDUCHERRY             564.202150
GOA                    548.508251
MIZORAM                535.500000
Pondicherry            529.000000
AR                     493.000000
Punjab                 474.333333
New Delhi              469.891071
Odisha                 408.107500
punjab                 398.600000
RJ                     355.000000
Arunachal pradesh      301.000000
Name: Amount, dtype: float64

### Ship City

In [96]:
df[df['month'] == 'May']['ship-city'].value_counts()

ship-city
BENGALURU                    3611
HYDERABAD                    2720
MUMBAI                       2046
NEW DELHI                    1852
CHENNAI                      1816
                             ...
PINARAYI                        1
GULABPURA, Distt BHILWARA       1
Prayagraj (ALLAHABAD)           1
Halol                           1
Raipur                          1
Name: count, Length: 4535, dtype: int64

In [97]:
df[df['month'] == 'May'].groupby('ship-city')['Amount'].sum().sort_values(ascending=False)

ship-city
BENGALURU                               2229804.60
HYDERABAD                               1709221.49
MUMBAI                                  1276890.11
NEW DELHI                               1144001.65
CHENNAI                                 1063852.00
                                           ...
Karamsad - anand                              0.00
Kanti Nagar extension, Krishna Nagar          0.00
Arangottukara                                 0.00
Aquem Margao                                  0.00
Vijay Pore                                    0.00
Name: Amount, Length: 4535, dtype: float64

In [98]:
df[df['month'] == 'May'].groupby('ship-city')['Amount'].mean().sort_values(ascending=False)

ship-city
RAJGARH CHURU DISTRICT         2372.0
Amrath                         1698.0
Hajipur                        1695.0
Tirupur                        1695.0
Mandya distic                  1648.0
                                ...
ARUMBAVUR                         0.0
CHODAVARAM                        0.0
Rangia                            0.0
Ramnagar                          0.0
Poyenge, Panvel, New Mumbai       0.0
Name: Amount, Length: 4535, dtype: float64

### Fulfilment

In [99]:
df[df['month'] == 'May']['Fulfilment'].value_counts()

Fulfilment
Amazon      28609
Merchant    13419
Name: count, dtype: int64

In [100]:
df[df['month'] == 'May'].groupby('Fulfilment')['Amount'].sum()

Fulfilment
Amazon      17697555.00
Merchant     8522295.75
Name: Amount, dtype: float64

In [101]:
df[df['month'] == 'May'].groupby('Fulfilment')['Amount'].mean()

Fulfilment
Amazon      618.600965
Merchant    635.091717
Name: Amount, dtype: float64

### Size

In [102]:
df[df['month'] == 'May']['Size'].value_counts()

Size
M       7270
L       6930
XL      6798
XXL     5917
S       5629
3XL     5113
XS      3441
6XL      374
5XL      256
4XL      178
Free     122
Name: count, dtype: int64

In [103]:
df[df['month'] == 'May'].groupby('Size')['Amount'].sum().sort_values(ascending=False)

Size
M       4557551.39
L       4260054.57
XL      4138869.35
XXL     3576005.87
S       3543778.63
3XL     3212305.39
XS      2211005.80
6XL      304510.84
5XL      198737.24
4XL      149260.67
Free      67771.00
Name: Amount, dtype: float64

In [104]:
df[df['month'] == 'May'].groupby('Size')['Amount'].mean()

Size
3XL     628.262349
4XL     838.543090
5XL     776.317344
6XL     814.200107
Free    555.500000
L       614.726489
M       626.898403
S       629.557405
XL      608.836327
XS      642.547457
XXL     604.361310
Name: Amount, dtype: float64

### Ship Service Level

In [105]:
df[df['month'] == 'May']['ship-service-level'].value_counts()

ship-service-level
Expedited    28284
Standard     13744
Name: count, dtype: int64

In [106]:
df[df['month'] == 'May'].groupby('ship-service-level')['Amount'].sum()

ship-service-level
Expedited    17685821.00
Standard      8534029.75
Name: Amount, dtype: float64

### Category

In [107]:
df[df['month'] == 'May']['Category'].value_counts()

Category
Set              16011
kurta            14927
Western Dress     6059
Top               4054
Ethnic Dress       451
Blouse             323
Bottom             150
Saree               53
Name: count, dtype: int64

In [108]:
df[df['month'] == 'May'].groupby('Category')['Amount'].sum().sort_values(ascending=False)

Category
Set              12640967.35
kurta             6657168.62
Western Dress     4381304.41
Top               1995120.16
Ethnic Dress       293092.34
Blouse             159794.68
Bottom              50866.57
Saree               41536.62
Name: Amount, dtype: float64

In [109]:
df[df['month'] == 'May'].groupby('Category')['Amount'].mean().sort_values(ascending=False)

Category
Set              789.517666
Saree            783.709811
Western Dress    723.106851
Ethnic Dress     649.872151
Blouse           494.720372
Top              492.136201
kurta            445.981686
Bottom           339.110467
Name: Amount, dtype: float64

### B2B

In [110]:
df[df['month'] == 'May']['B2B'].value_counts()

B2B
False    41746
True       282
Name: count, dtype: int64

In [111]:
df[df['month'] == 'May'].groupby('B2B')['Amount'].sum()

B2B
False    26031692.11
True       188158.64
Name: Amount, dtype: float64

### Courier Status

In [112]:
df[df['month'] == 'May']['Courier Status'].value_counts()

Courier Status
Shipped      36077
Unshipped     4076
Cancelled     1875
Name: count, dtype: int64

In [113]:
df[df['month'] == 'May'].groupby('Courier Status')['Amount'].sum()

Courier Status
Cancelled           0.00
Shipped      23942386.00
Unshipped     2277464.75
Name: Amount, dtype: float64

## June

### Total Revenue, Order, AOV

In [114]:
june_totalAmt = df.loc[df['month'] == 'June', 'Amount'].sum()
june_totalOdr = df.loc[df['month'] == 'June', 'Order ID'].nunique()
june_AOV = june_totalAmt/june_totalOdr

print(f"Total Order Amount in June: {june_totalAmt}")
print(f"Total Orders in June: {june_totalOdr}")
print(f"Average Order Value in June: {june_AOV}")

Total Order Amount in June: 23421223.38
Total Orders in June: 35135
Average Order Value in June: 666.6066139177458

### Ship State

In [115]:
df[df['month'] == 'June']['ship-state'].value_counts()

ship-state
MAHARASHTRA           6440
KARNATAKA             5314
TELANGANA             3563
TAMIL NADU            3533
UTTAR PRADESH         2879
KERALA                2004
DELHI                 1906
ANDHRA PRADESH        1745
WEST BENGAL           1542
HARYANA               1253
Gujarat               1224
MADHYA PRADESH         749
RAJASTHAN              737
ODISHA                 659
BIHAR                  578
PUNJAB                 511
ASSAM                  467
UTTARAKHAND            395
JHARKHAND              336
GOA                    304
CHHATTISGARH           252
HIMACHAL PRADESH       233
JAMMU & KASHMIR        221
PUDUCHERRY             117
CHANDIGARH              95
ANDAMAN & NICOBAR       88
NAGALAND                73
SIKKIM                  71
MANIPUR                 62
MEGHALAYA               61
Delhi                   52
TRIPURA                 38
ARUNACHAL PRADESH       38
MIZORAM                 27
DADRA AND NAGAR         19
New Delhi               19
LADAKH                  18
Rajasthan               14
Punjab                  10
delhi                    7
Goa                      7
Bihar                    6
Odisha                   5
Chandigarh               3
Meghalaya                3
Sikkim                   2
Orissa                   2
NL                       1
Manipur                  1
Mizoram                  1
rajsthan                 1
punjab                   1
LAKSHADWEEP              1
Rajsthan                 1
Name: count, dtype: int64

In [116]:
df[df['month'] == 'June'].groupby('ship-state')['Amount'].sum().sort_values(ascending=False)

ship-state
MAHARASHTRA           3884653.39
KARNATAKA             3310627.32
TELANGANA             2251970.16
TAMIL NADU            2057466.17
UTTAR PRADESH         1866921.69
DELHI                 1226215.47
KERALA                1185978.01
ANDHRA PRADESH        1036135.67
WEST BENGAL            946179.10
HARYANA                848337.24
Gujarat                761536.84
RAJASTHAN              485165.19
MADHYA PRADESH         471665.19
ODISHA                 441962.33
BIHAR                  390859.56
PUNJAB                 321406.22
ASSAM                  294358.21
UTTARAKHAND            245389.73
JHARKHAND              213462.32
GOA                    172548.70
HIMACHAL PRADESH       153110.15
CHHATTISGARH           152960.00
JAMMU & KASHMIR        144863.81
PUDUCHERRY              70751.95
NAGALAND                58979.81
CHANDIGARH              56934.67
ANDAMAN & NICOBAR       55927.92
SIKKIM                  45389.00
MANIPUR                 44353.00
MEGHALAYA               37955.15
Delhi                   31919.48
ARUNACHAL PRADESH       28387.00
TRIPURA                 27597.07
MIZORAM                 16691.71
LADAKH                  15927.43
New Delhi               10555.00
DADRA AND NAGAR         10025.48
Rajasthan                9963.33
Punjab                   8010.00
delhi                    7202.00
Bihar                    4191.00
Goa                      3395.00
Odisha                   3087.00
Chandigarh               2248.00
Sikkim                   1517.00
Orissa                   1140.00
punjab                    958.00
Meghalaya                 921.91
LAKSHADWEEP               845.00
Mizoram                   735.00
rajsthan                  521.00
Rajsthan                  443.00
NL                        443.00
Manipur                   436.00
Name: Amount, dtype: float64

In [117]:
df[df['month'] == 'June'].groupby('ship-state')['Amount'].mean().sort_values(ascending=False)

ship-state
delhi                 1028.857143
punjab                 958.000000
LADAKH                 884.857222
LAKSHADWEEP            845.000000
NAGALAND               807.942603
Punjab                 801.000000
Sikkim                 758.500000
Chandigarh             749.333333
ARUNACHAL PRADESH      747.026316
Mizoram                735.000000
TRIPURA                726.238684
MANIPUR                715.370968
Rajasthan              711.666429
Bihar                  698.500000
HARYANA                677.044884
BIHAR                  676.227612
ODISHA                 670.656039
RAJASTHAN              658.297408
HIMACHAL PRADESH       657.125107
JAMMU & KASHMIR        655.492353
UTTAR PRADESH          648.461858
DELHI                  643.344948
SIKKIM                 639.281690
ANDAMAN & NICOBAR      635.544545
JHARKHAND              635.304524
TELANGANA              632.043267
ASSAM                  630.317366
MADHYA PRADESH         629.726555
PUNJAB                 628.974990
KARNATAKA              623.001001
MEGHALAYA              622.215574
Gujarat                622.170621
UTTARAKHAND            621.239823
MIZORAM                618.211481
Odisha                 617.400000
Delhi                  613.836154
WEST BENGAL            613.605123
CHHATTISGARH           606.984127
PUDUCHERRY             604.717521
MAHARASHTRA            603.207048
CHANDIGARH             599.312316
ANDHRA PRADESH         593.774023
KERALA                 591.805394
TAMIL NADU             582.356686
Orissa                 570.000000
GOA                    567.594408
New Delhi              555.526316
DADRA AND NAGAR        527.656842
rajsthan               521.000000
Goa                    485.000000
Rajsthan               443.000000
NL                     443.000000
Manipur                436.000000
Meghalaya              307.303333
Name: Amount, dtype: float64

### Ship City

In [118]:
df[df['month'] == 'June']['ship-city'].value_counts()

ship-city
BENGALURU                     3508
HYDERABAD                     2584
MUMBAI                        1752
CHENNAI                       1720
NEW DELHI                     1644
                              ...
VARANASIVaranasi                 1
PONNANI                          1
ARANI THIRUVALLUR DISTRICT       1
Cherukunnu (p.o)                 1
Cheppad                          1
Name: count, Length: 4215, dtype: int64

In [119]:
df[df['month'] == 'June'].groupby('ship-city')['Amount'].sum().sort_values(ascending=False)

ship-city
BENGALURU           2239445.49
HYDERABAD           1629521.54
MUMBAI              1069331.92
NEW DELHI           1058366.09
CHENNAI             1014904.30
                       ...
MAITHON                   0.00
NAUGARH                   0.00
CHERUKAVU                 0.00
Vikarabad pudur           0.00
TALEGAON Dabhade          0.00
Name: Amount, Length: 4215, dtype: float64

In [120]:
df[df['month'] == 'June'].groupby('ship-city')['Amount'].mean().sort_values(ascending=False)

ship-city
DIGRAS                                    2598.0
jagadhri                                  1613.0
Jashpurnagar                              1613.0
SAKHINETIPALLE                            1610.0
Kanuvai, coimbatore                       1610.0
                                           ...
PRATAPGARH                                   0.0
PUNE city                                    0.0
KALYAN (E)                                   0.0
BASUDEBPUR                                   0.0
Thirupatture district,Tamilnadu.india.       0.0
Name: Amount, Length: 4215, dtype: float64

### Fulfilment

In [121]:
df[df['month'] == 'June']['Fulfilment'].value_counts()

Fulfilment
Amazon      27660
Merchant    10029
Name: count, dtype: int64

In [122]:
df[df['month'] == 'June'].groupby('Fulfilment')['Amount'].sum()

Fulfilment
Amazon      16971020.00
Merchant     6450203.38
Name: Amount, dtype: float64

In [123]:
df[df['month'] == 'June'].groupby('Fulfilment')['Amount'].mean()

Fulfilment
Amazon      613.558207
Merchant    643.155188
Name: Amount, dtype: float64

### Size

In [124]:
df[df['month'] == 'June']['Size'].value_counts()

Size
M       6805
L       6525
XL      6179
XXL     5454
S       4733
3XL     4043
XS      3303
6XL      244
5XL      185
4XL      155
Free      63
Name: count, dtype: int64

In [125]:
df[df['month'] == 'June'].groupby('Size')['Amount'].sum().sort_values(ascending=False)

Size
M       4162566.93
L       4009000.86
XL      3825172.02
XXL     3224879.58
S       2966379.47
3XL     2584209.97
XS      2110597.19
6XL      206014.53
5XL      164865.25
4XL      131044.58
Free      36493.00
Name: Amount, dtype: float64

In [126]:
df[df['month'] == 'June'].groupby('Size')['Amount'].mean()

Size
3XL     639.181294
4XL     845.448903
5XL     891.163514
6XL     844.321844
Free    579.253968
L       614.406262
M       611.692422
S       626.744025
XL      619.060045
XS      638.994002
XXL     591.287052
Name: Amount, dtype: float64

### Ship Service Level

In [127]:
df[df['month'] == 'June']['ship-service-level'].value_counts()

ship-service-level
Expedited    27317
Standard     10372
Name: count, dtype: int64

In [128]:
df[df['month'] == 'June'].groupby('ship-service-level')['Amount'].sum()

ship-service-level
Expedited    16960599.00
Standard      6460624.38
Name: Amount, dtype: float64

### Category

In [129]:
df[df['month'] == 'June']['Category'].value_counts()

Category
kurta            15117
Set              13986
Western Dress     5267
Top               2630
Ethnic Dress       356
Blouse             184
Bottom             110
Saree               36
Dupatta              3
Name: count, dtype: int64

In [130]:
df[df['month'] == 'June'].groupby('Category')['Amount'].sum().sort_values(ascending=False)

Category
Set              10997368.12
kurta             6586215.03
Western Dress     3898599.49
Top               1525780.92
Ethnic Dress       246359.67
Blouse             102750.29
Bottom              36492.96
Saree               26741.90
Dupatta               915.00
Name: Amount, dtype: float64

In [131]:
df[df['month'] == 'June'].groupby('Category')['Amount'].mean().sort_values(ascending=False)

Category
Set              786.312607
Saree            742.830556
Western Dress    740.193562
Ethnic Dress     692.021545
Top              580.144837
Blouse           558.425489
kurta            435.682677
Bottom           331.754182
Dupatta          305.000000
Name: Amount, dtype: float64

### B2B

In [132]:
df[df['month'] == 'June']['B2B'].value_counts()

B2B
False    37449
True       240
Name: count, dtype: int64

In [133]:
df[df['month'] == 'June'].groupby('B2B')['Amount'].sum()

B2B
False    23252676.09
True       168547.29
Name: Amount, dtype: float64

### Courier Status

In [134]:
df[df['month'] == 'June']['Courier Status'].value_counts()

Courier Status
Shipped      31403
Unshipped     4495
Cancelled     1791
Name: count, dtype: int64

In [135]:
df[df['month'] == 'June'].groupby('Courier Status')['Amount'].sum()

Courier Status
Cancelled           0.00
Shipped      20776626.00
Unshipped     2644597.38
Name: Amount, dtype: float64